app/views/restaurants/index.html.haml


        - if restaurant.reviews.any?
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 2]]

                = link_to "Like", review_endorsements_path(review), class: 'endorsements-link'
                %span.endorsements_count= review.endorsements.count
---
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 1]]