app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "shit"], ["user_id", 1], ["created_at", "2015-05-05 15:54:10.241324"], ["updated_at", "2015-05-05 15:54:10.241324"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "restaurants" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["image_updated_at", "2015-05-12 17:28:54.972435"], ["image_file_name", "saathi.jpg"], ["updated_at", "2015-05-12 17:28:57.433338"], ["id", 3]]
---
  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)