app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("thoughts", "rating", "restaurant_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "nice"], ["rating", 1], ["restaurant_id", 6], ["user_id", 1], ["created_at", "2015-05-05 17:24:26.806540"], ["updated_at", "2015-05-05 17:24:26.806540"]]
---
  def create
    restaurant = Restaurant.find(params[:restaurant_id])

    if current_user.has_reviewed? restaurant
      flash[:notice] = 'You have already reviewed this restaurant'
      redirect_to restaurants_path
    else
      new_review = restaurant.create_review current_user, review_params

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 6]]
---
  def destroy
    @review = Review.find(params[:id])
    if current_user.id == @review.user_id
      @review.destroy